site/app/controllers/flickr_configs_controller.rb

  def index
    @flickr_configs = FlickrConfig.all
---
SELECT * FROM "flickr_configs"

  def show
    @flickr_config = FlickrConfig.find(params[:id])
---
SELECT * FROM "flickr_configs" WHERE ("flickr_configs"."id" = 1)

  def create
    @flickr_config = FlickrConfig.new(params[:flickr_config])

    respond_to do |format|
      if @flickr_config.save
---
INSERT INTO "flickr_configs" ("created_at", "updated_at", "key", "secret") VALUES('2010-09-19 22:10:13', '2010-09-19 22:10:13', 'ea5dc2e30f398dd7f1e295f19b2eb823', 'cf7bec38930081cd')